/*
 * TWI.h
 *
 * Created: 26.02.2020 14:02:04
 *  Author: GaD_Bogdan
 */ 


#ifndef TWI_H_
#define TWI_H_

#include "main.h"
//=============================================================================================

/*Инициализация шини I2C, устновка скорости работы*/
void I2C_Init(void);

//=============================================================================================

/*Передача в шину условия старт. После чего ожидается завершение*/
void I2C_StartCondition(void);

//=============================================================================================

/*Передача в шину условия стоп*/
void I2C_StopCondition(void);

//=============================================================================================

/*Передача в шину одного байта данных. После чего ожидается завершение*/
void I2C_SendByte(unsigned char data);

//=============================================================================================

/*Передача в шину условие старт, после чего отправляется байт addr,
  затем передается байт data, после чего условие stop*/
void I2C_SendByteByAddr(unsigned char data, unsigned char addr);

//=============================================================================================

/*Чтение одного байта из шины I2C*/
unsigned char I2C_ReadByte(void);

//=============================================================================================

/*Чтение последнего необходимого байти из шини(флаг Ack не отправляется)*/
unsigned char I2C_ReadLastByte(void);

//=============================================================================================
#endif /* TWI_H_ */