/*
 * DS3231.h
 *
 * Created: 26.02.2020 17:15:36
 *  Author: GaD_Bogdan
 */ 


#ifndef DS3231_H_
#define DS3231_H_

#include "main.h"
//=============================================================================================

/*Превращаем наше значение в понятный RTC вид, а именно в двоично-десятичный код*/
unsigned char RTC_ConvertFromDecToBD(unsigned char data);

//=============================================================================================

/*Преобразование двоично-десятичного кода в обычное число*/
unsigned char RTC_ConvertFromBDToDec(unsigned char data);

//===================================================================================================================

#endif /* DS3231_H_ */